const lenguaje = () => {
return 'hi'
} //HINDI

//MESSAGE NOTICES
const smsAvisoRG = () => {
return `╰⊱✅⊱ *परिणाम* ⊱✅⊱╮\n\n`
}
const smsAvisoAG = () => {
return `╰⊱⚠️⊱ *चेतावनी* ⊱⚠️⊱╮\n\n`
}
const smsAvisoIIG = () => {
return `╰⊱❕⊱ *सूचना* ⊱❕⊱╮\n\n`
}
const smsAvisoFG = () => {
return `╰⊱❌⊱ *त्रुटि* ⊱❌⊱╮\n\n`
}
const smsAvisoMG = () => {
return `╰⊱❗️⊱ *गलत इस्तेमाल* ⊱❗️⊱╮\n\n`
}
const smsAvisoEEG = () => {
return `╰⊱📩⊱ *रिपोर्ट* ⊱📩⊱╮\n\n`
}
const smsAvisoEG = () => {
return `╰⊱💚⊱ *सफलता* ⊱💚⊱╮\n\n`
}

//PARAMETERS IN COMMANDS
const smsRowner = () => {
return `\`\`\`¡¡इस कमांड का उपयोग करने की अनुमति केवल मैं बॉट निर्माता के रूप में कर सकता हूँ!!\`\`\``
} //BOT NUMBER
const smsOwner = () => {
return `\`\`\`¡¡इस कमांड का उपयोग करने की अनुमति केवल मेरे निर्माता के रूप में कर सकता है!!\`\`\``
} //OWNER
const smsMods = () => {
return `\`\`\`¡¡इस कमांड का उपयोग करने की अनुमति केवल मॉडरेटर और मेरे निर्माता के रूप में कर सकते हैं!!\`\`\``
} //MODERATORS
const smsPremium = () => {
return `\`\`\`¡¡प्रीमियम उपयोगकर्ताओं और मेरे निर्माता के लिए यह कमांड केवल उपलब्ध है!! प्रीमियम पास खरीदने के लिए #pass premium का उपयोग करें\`\`\``
} //PREMIUM USERS
const smsGroup = () => {
return `\`\`\`¡¡यह कमांड केवल समूहों में उपयोग करने के लिए उपलब्ध है!!\`\`\``
} //FOR GROUPS
const smsPrivate = () => {
return `\`\`\`¡¡यह कमांड केवल निजी में उपयोग करने के लिए उपलब्ध है!!\`\`\``
} //TO THE PRIVATE
const smsAdmin = () => {
return `\`\`\`¡¡इस कमांड के लिए केवल व्यवस्थापकों के लिए है!!\`\`\``
} //ADMINS
const smsBotAdmin = () => {
return `\`\`\`¡¡मुझे इस कमांड का उपयोग करने के लिए व्यवस्थापक बनाने की आवश्यकता है!!\`\`\``
} //BOT WITH ADMIN
const smsUnreg = () => {
return `\`\`\`¡¡इस कमांड का उपयोग करने के लिए आपको पंजीकृत होना चाहिए, पंजीकरण के लिए #verify लिखें!!\`\`\``
} //VERIFY
const smsRestrict = () => {
return `\`\`\`¡¡इस कमांड के उपयोग को मेरे निर्माता ने रोका हुआ है!!\`\`\``
} //RESTRICT COMMAND

//LIST MENU
const smsTime = () => {
return `वर्तमान समय`
}
const smsUptime = () => {
return `चल रहा है दौरान`
}
const smsVersion = () => {
return `संस्करण ${global.gt}`
}
const smsTotalUsers = () => {
return `कुल उपयोगकर्ता`
}
const smsMode = () => {
return `यह मोड में है`
}
const smsModePublic = () => {
return `सार्वजनिक`
}
const smsModePrivate = () => {
return `निजी`
}
const smsBanChats = () => {
return `निषिद्ध चैट`
}
const smsBanUsers = () => {
return `निषिद्ध उपयोगकर्ता`
}
const smsPareja = () => {
return `जोड़ी`
}
const smsResultPareja = () => {
return `एकल`
}
const smsSaludo = () => {
return `👋 नमस्ते! स्वागत है 👋`
}
const smsDia = () => {
return `🌇 सुप्रभात ⛅`
}
const smsTarde = () => {
return `🏙️ शुभ संध्या 🌤️`
}
const smsTarde2 = () => {
return `🌆 शुभ संध्या 🌥️`
}
const smsNoche = () => {
return `🌃 शुभ रात्रि 💫`
}
const smsListaMenu = () => {
return `⊹ मेनू सूची ⊹`
}
const smsLista1 = () => {
return `🌟 GATABOT सूचना 🌟`
}
const smsLista2 = () => {
return `💖 निर्माता 💖`
}
const smsLista3 = () => {
return `🎁 दान करें : समर्थन 🎁`
}
const smsLista4 = () => {
return `🚀 गति 🚀`
}
const smsLista5 = () => {
return `💡 मेनू सूचना 💡`
}
const smsLista6 = () => {
return `🌀 पूर्ण मेनू 🌀`
}
const smsLista7 = () => {
return `🐈 गैटाबॉट स्थापित करें 🐈`
}
const smsLista8 = () => {
return `🍄 सब बॉट बनें 🍄`
}
const smsLista9 = () => {
return `📄 नियम, शर्तें और गोपनीयता 📄`
}
const smsLista10 = () => {
return `🌟 प्रस्तावना और शीर्ष 🌟`
}
const smsLista11 = () => {
return `🏆 विश्व शीर्ष 🏆`
}
const smsLista12 = () => {
return `🏅 प्रीमियम उपयोगकर्ता 🏅`
}
const smsLista13 = () => {
return `🎟️ प्रीमियम उपयोगकर्ता बनें 🎟️`
}
const smsLista14 = () => {
return `🛣️ मिशन 🛣️`
}
const smsLista15 = () => {
return `⚗️ आरपीजी मेनू ⚗️`
}
const smsLista16 = () => {
return `🏪 दुकान खरीदें 🏪`
}
const smsLista17 = () => {
return `🎒 इन्वेंटरी 🎒`
}
const smsLista18 = () => {
return `🌟 बहुमीडिया 🌟`
}
const smsLista19 = () => {
return `📲 डाउनलोड मेनू 📲`
}
const smsLista20 = () => {
return `🔍 खोज मेनू 🔍`
}
const smsLista21 = () => {
return `🛰️ परिवर्तक मेनू 🛰️`
}
const smsLista22 = () => {
return `🧰 ऑडियो संशोधक मेनू 🧰`
}
const smsLista22_1 = () => {
return `🔩 टूल मेनू 🔩`
}
const smsLista23 = () => {
return `🌟 मजेदार 🌟`
}
const smsLista24 = () => {
return `🎡 गतिविधियाँ 🎡`
}
const smsLista25 = () => {
return `🔊 ऑडियो मेनू 🔊`
}
const smsLista26 = () => {
return `🎈 स्टिकर और फ़िल्टर्स मेनू 🎈`
}
const smsLista27 = () => {
return `✨ प्रभाव और लोगो मेनू ✨`
}
const smsLista28 = () => {
return `🌅 लोगो मेनू 2 🌅`
}
const smsLista29 = () => {
return `⛩️ यादृच्छिक मीम और एनिमे ⛩️`
}
const smsLista30 = () => {
return `🔞 वयस्कों के लिए कमांड 🔞`
}
const smsLista31 = () => {
return `🌟 सेटिंग्स 🌟`
}
const smsLista32 = () => {
return `🔰 समूहों के लिए मेनू 🔰`
}
const smsLista33 = () => {
return `📑 सूचियों के प्रकार 📑`
}
const smsLista34 = () => {
return `⚙️ कॉन्फ़िगरेशन केंद्र ⚙️`
}
const smsLista35 = () => {
return `💎 मालिक मेनू 💎`
}

//main.js
const smsWelcome = () => {
return `*╭┈⊰* @subject *⊰┈ ✦*\n*┊✨ स्वागत है!!*\n┊💖 @user\n┊📄 *समूह विवरण पढ़ें*\n*╰┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈ ✦*\n${String.fromCharCode(8206).repeat(850)}\n@desc`
}
const smsBye = () => {
return '*╭┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈⊰*\n┊ @user\n┊ *उन्होंने समूह को छोड़ दिया, जल्दी वापस आएं* 😎\n*╰┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈⊰*'
}
const smsSpromote = () => {
return '*@user, आप अब इस समूह में एडमिन हैं!!*'
}
const smsSdemote = () => {
return '*@user, इस समूह में एडमिन नहीं हैं अब!!*'
}
const smsSdesc = () => {
return '*समूह का नया विवरण है:*\n\n@desc'
}
const smsSsubject = () => {
return '*समूह का नया नाम है:*\n\n@subject'
}
const smsSicon = () => {
return '*इस समूह की फोटो बदल दी गई है!!*'
}
const smsSrevoke = () => {
return '*अब यह समूह का नया लिंक है:*\n\n*@revoke*'
}
const smsConexion = () => {
return `\n𓃠 ┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈✦ 🟢 कनेक्शन ✦┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈ 𓃠\n│\n│★ व्हाट्सएप से सफल कनेक्शन 😺\n│\n𓃠 ┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈✦ ✅ ✦┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈ 𓃠`
}
const smsCargando = () => {
return `😸 लोड हो रहा है...\n`
}
const smsCodigoQR = () => {
return `\n✅ 45 सेकंड में क्यूआर कोड स्कैन करें ✅`
}
const smsConexionOFF = () => {
return `\n⚠️ कोई कनेक्शन नहीं, ${global.authFile} फ़ोल्डर को हटा दें और क्यूआर कोड स्कैन करें ⚠️`
}
const smsClearTmp = () => {
return `\n╭» 🟢 मल्टीमीडिया 🟢\n│☁ टीएमपी फ़ोल्डर से फ़ाइलें हटा दी गईं\n╰―――――――――――――――――――✤`
}
const smspurgeSession = () => {
return `\n╭» 🔵 ${global.authFile} 🔵\n│☁ गैरजरूरी सत्रों को हटा दिया गया\n╰―――――――――――――――――――✤`
}
const smspurgeOldFiles = () => {
return `\n╭» 🟠 फ़ाइलें 🟠\n│☁ रेसिड्यूल फ़ाइलें हटा दी गईं\n╰―――――――――――――――――――✤`
}
const smspurgeSessionSB1 = () => {
return `\n╭» 🟡 GataJadiBot 🟡\n│☁ कुछ हटाने के लिए नहीं\n╰―――――――――――――――――――✤`
}
const smspurgeSessionSB2 = () => {
return `\n╭» ⚪ GataJadiBot ⚪\n│☁ गैरजरूरी फ़ाइलें हटा दी गईं\n╰―――――――――――――――――――✤`
}
const smspurgeSessionSB3 = () => {
return `\n╭» 🔴 GataJadiBot 🔴\n│☁ एक त्रुटि हुई है\n╰―――――――――――――――――――✤\n`
}
const smspurgeOldFiles1 = () => {
return `\n╭» 🟣 अभिलेख 🟣\n│☁`
}
const smspurgeOldFiles2 = () => {
return `सफलतापूर्वक हटा दिया गया\n╰―――――――――――――――――――✤`
}
const smspurgeOldFiles3 = () => {
return `\n╭» 🔴 अभिलेख 🔴\n│☁`
}
const smspurgeOldFiles4 = () => {
return `हटाने में विफल\n╰―――――――――――――――――――✤\n`
}

//_allantilink.js
const smsTextoYT = () => {
return '😻 सुपर गटा बॉट-एमडी - WhatsApp '
}
const smsApagar = () => {
return '❌ निष्क्रिय करें'
}
const smsEncender = () => {
return '✅ सक्रिय करें'
}
const smsEnlaceTik = () => {
return `*इस समूह में एक प्रतिबंधित TIKTOK लिंक खोजा गया है*\n\n*मैं आपको हटाने की क्रिया करता हूँ*`
}
const smsEnlaceYt = () => {
return `*इस समूह में एक प्रतिबंधित YOUTUBE लिंक खोजा गया है*\n\n*मैं आपको हटाने की क्रिया करता हूँ*`
}
const smsEnlaceTel = () => {
return `*इस समूह में एक प्रतिबंधित TELEGRAM लिंक खोजा गया है*\n\n*मैं आपको हटाने की क्रिया करता हूँ*`
}
const smsEnlaceFb = () => {
return `*इस समूह में एक प्रतिबंधित FACEBOOK लिंक खोजा गया है*\n\n*मैं आपको हटाने की क्रिया करता हूँ*`
}
const smsEnlaceIg = () => {
return `*इस समूह में एक प्रतिबंधित INSTAGRAM लिंक खोजा गया है*\n\n*मैं आपको हटाने की क्रिया करता हूँ*`
}
const smsEnlaceTw = () => {
return `*इस समूह में एक प्रतिबंधित TWITTER लिंक खोजा गया है*\n\n*मैं आपको हटाने की क्रिया करता हूँ*`
}
const smsAllAdmin = () => {
return `*मुझे एडमिन होने की जरूरत है कि मैं अतिक्रमण को हटा सकूँ*`
}
const smsSoloOwner = () => {
return `*मेरे सृजक को फ़ंक्शन को सक्षम करना होगा*\n*#on restrict*`
}

//handler.js
const smsCont1 = () => {
return `*🔴 कमांड असफल 🔴*`
}
const smsCont2 = () => {
return `*⚠️ प्लगइन:*`
}
const smsCont3 = () => {
return `*⚠️ उपयोगकर्ता:*`
}
const smsCont4 = () => {
return `*⚠️ कमांड:*`
}
const smsCont5 = () => {
return `*⚠️ त्रुटि:*`
}
const smsCont6 = () => {
return `*❗ इस संदेश को #reporte कमांड का उपयोग करके रिपोर्ट करें ताकि यह हल हो सके*`
}
const smsCont7 = () => {
return `${global.lenguajeGB['smsAvisoAG']()}*डायमंड नहीं है!! 💎 आप #store कमांड के साथ क़दम रख सकते हैं*`
}
const smsCont8 = () => {
return `*डायमंड 💎 का उपयोग किया गया*`
}
const smsCont9 = () => {
return `${global.lenguajeGB['smsAvisoAG']()}*आवश्यकता है कि वर्तमान स्तर हो*`
}
const smsCont10 = () => {
return `*इस कमांड का उपयोग करने के लिए। आपका वर्तमान स्तर है*`
}
const smsCont11 = () => {
return `*कमांड के साथ अपडेट करें*`
}
const smsCont12 = () => {
return `एक बड़ा समूह!! 😼`
}
const smsCont13 = () => {
return `कोई शामिल हुआ!! 🥳`
}
const smsCont14 = () => {
return `कोई चला गया!! 🧐`
}
const smsCont15 = () => {
return `*नमस्कार*`
}
const smsCont16 = () => {
return `*वीडियो कॉल* 📲`
}
const smsCont17 = () => {
return `*कॉल* 📞`
}
const smsCont18 = () => {
return `*वे अधिकृत नहीं हैं, इसलिए मैं आपको ब्लॉक कर रहा हूं*\n\n*यदि आपने त्रुटि से कॉल किया है तो इस बॉट के निर्माता से संपर्क करें*`
}
const smsCont19 = () => {
return `एंटी डिलीट`
}
const smsCont20 = () => {
return `*┃✤ नाम:*`
}
const smsCont21 = () => {
return `*┃✤ हटाए गए संदेश भेजा जा रहा है...*`
}

//_anti-internacional.js
const smsInt1 = () => {
return `*इस नंबर*`
}
const smsInt2 = () => {
return `*इस समूह में अनुमति नहीं है!!*`
}

//_antilink.js
const smsAdwa = () => {
return `${global.lenguajeGB['smsAvisoEG']()}*आप इस समूह में एडमिन होने के कारण आपको हटाया नहीं जाएगा*`
}
const smsEnlaceWat = () => {
return `${lenguajeGB['smsAvisoAG']()}*इस समूह में एक प्रतिबंधित WHATSAPP लिंक खोजा गया है*\n\n*मैं आपको हटाने की क्रिया करता हूँ*`
}

//_antilink2.js
const smsEnlaceWatt = () => {
return `${lenguajeGB['smsAvisoAG']()}*इस समूह में एक प्रतिबंधित HTTPS सम्मिलित लिंक खोजा गया है*\n\n*मैं आपको हटाने की क्रिया करता हूँ*`
}

//_antispam.js
const smsNoSpam = () => {
return `🤨 स्पैम न करें, आप ${global.packname} का उपयोग ${60000 / 1000 - 59} मिनट तक नहीं कर पाएंगे`
}

//_antispam_.js
const smsNoSpam2 = () => {
return `${60000 / 1000 - 59} मिनट के बाद अनबैन हुआ। कृपया स्पैम न करें!!`
}

//Texto
const smsConMenu = () => {
return `☘️ मेन्यू`
}

//Error
const smsMalError = () => {
return `${lenguajeGB['smsAvisoFG']()}\`\`\`एक अप्रत्याशित त्रुटि हुई है।\`\`\``
}
const smsMalError2 = () => {
return `${lenguajeGB['smsAvisoFG']()}\`\`\`एक असुविधा उत्पन्न हुई है। कृपया पुनः प्रयास करें।\`\`\``
}
const smsMalError3 = () => {
return `${lenguajeGB['smsAvisoFG']()}\`\`\`कुछ गड़बड़ हो गई है, इस कमांड को #reporte का उपयोग करके रिपोर्ट करें:\`\`\`\n`
}

//_antitoxic.js
const smsToxic1 = () => {
return `नहीं!!! 🤬 यह शब्द कहें`
}
const smsToxic2 = () => {
return `यह निषिद्ध है, टॉक्सिक न हों`
}
const smsToxic3 = () => {
return `*चेतावनी*\n⚠️`
}
const smsToxic4 = () => {
return `😭 माफ़ कीजिए`
}
const smsToxic5 = () => {
return `☢️ एंटी टॉक्सिक अक्षम करें`
}
const smsToxic6 = () => {
return `मैंने आपको कई बार चेतावनी दी है!!`
}
const smsToxic7 = () => {
return `आपने सभी 4 चेतावनियों को पार कर दिया है अब आपको हटा दिया जाएगा 🙄`
}

//Tienda
const eExp = () => {
return '⚡ अनुभव'
}
const eDiamante = () => {
return '💎 हीरा'
}
const eDiamantePlus = () => {
return '💎+ डायमंड+'
}
const eToken = () => {
return '🪙 टोकन'
}
const eEsmeralda = () => {
return '💚 एमरल्ड'
}
const eJoya = () => {
return '♦️ जेवल'
}
const eMagia = () => {
return '🌀 जादू'
}
const eOro = () => {
return '👑 सोना'
}
const eGataCoins = () => {
return '🐱 गाटा कॉइंस'
}
const eGataTickers = () => {
return '🎫 गाटा टिकर्स'
}
const eEnergia = () => {
return '✨ ऊर्जा'
}

const ePocion = () => {
return '🥤 पोशन'
}
const eAgua = () => {
return '💧 पानी'
}
const eBasura = () => {
return '🗑 कचरा'
}
const eMadera = () => {
return '🪵 लकड़ी'
}
const eRoca = () => {
return '🪨 पत्थर'
}
const ePiedra = () => {
return '🥌 पत्थर'
}
const eCuerda = () => {
return '🕸️ तार'
}
const eHierro = () => {
return '⛓️ लोहा'
}
const eCarbon = () => {
return '⚱️ कोयला'
}
const eBotella = () => {
return '🍶 बोतल'
}
const eLata = () => {
return '🥫 कैन'
}
const eCarton = () => {
return '🪧 पेपरबोर्ड'
}

const eEletric = () => {
return '💡 बिजली'
}
const eBarraOro = () => {
return '〽️ सोने की बार'
}
const eOroComun = () => {
return '🧭 सामान्य सोना'
}
const eZorroG = () => {
return '🦊🌫️ बड़ा लोमड़ी'
}
const eBasuraG = () => {
return '🗑🌫️ सुपर कचरा'
}
const eLoboG = () => {
return '🐺🌫️ सुपर भेड़िया'
}
const eMaderaG = () => {
return '🛷🌫️ सुपर लकड़ी'
}
const eEspada = () => {
return '⚔️ तलवार'
}
const eCarnada = () => {
return '🪱 मस्स'
}
const eBillete = () => {
return '💵 नोट'
}
const ePinata = () => {
return '🪅 पिनाटा'
}
const eGancho = () => {
return '🪝 हुक'
}
const eCanaPescar = () => {
return '🎣 मछली पकड़ने की छड़ी'
}

const eCComun = () => {
return '📦 सामान्य बॉक्स'
}
const ePComun = () => {
return '🥡 असामान्य बॉक्स'
}
const eCMistica = () => {
return '🗳️ मिथिक बॉक्स'
}
const eCMascota = () => {
return '📫 पालतू जानवर बॉक्स'
}
const eCJardineria = () => {
return '💐 बगीचावाड़ी बॉक्स'
}
const eClegendaria = () => {
return '🎁 लैजेंडरी बॉक्स'
}

const eUva = () => {
return '🍇 अंगूर'
}
const eManzana = () => {
return '🍎 सेब'
}
const eNaranja = () => {
return '🍊 संतरा'
}
const eMango = () => {
return '🥭 आम'
}
const ePlatano = () => {
return '🍌 केला'
}

const eSUva = () => {
return '🌾🍇 अंगूर के बीज'
}
const eSManzana = () => {
return '🌾🍎 सेब के बीज'
}
const eSNaranja = () => {
return '🌾🍊 संतरा के बीज'
}
const eSMango = () => {
return '🌾🥭 आम के बीज'
}
const eSPlatano = () => {
return '🌾🍌 केले के बीज'
}

const eCentauro = () => {
return '🐐 सेंटॉर'
}
const eAve = () => {
return '🦅 पक्षी'
}
const eGato = () => {
return '🐈 बिल्ली'
}
const eDragon = () => {
return '🐉 ड्रैगन'
}
const eZorro = () => {
return '🦊 लोमड़ी'
}
const eCaballo = () => {
return '🐎 घोड़ा'
}
const eFenix = () => {
return '🕊️ फ़ीनिक्स'
}
const eLobo = () => {
return '🐺 भेड़िया'
}
const ePerro = () => {
return '🐶 कुत्ता'
}
const eAMascots = () => {
return '🍖 पालतू जानवर का भोजन'
}
const eCCentauro = () => {
return '🐐🥩 सेंटॉर का भोजन'
}
const eCAve = () => {
return '🦅🥩 पक्षी का भोजन'
}
const eCMagica = () => {
return '🌀🥩 जादुई भोजन'
}
const eCDragon = () => {
return '🐉🥩 ड्रैगन का भोजन'
}
const eACaballo = () => {
return '🐎🥩 घोड़े का भोजन'
}
const eCFenix = () => {
return '🕊️🥩 फ़ीनिक्स का भोजन'
}

//config-on y off.js
const smsWel1 = () => {
return `🎉 स्वागत है`
}
const smsWel2 = () => {
return `समूहों में नए सदस्यों के लिए स्वागत संदेश`
}
const smsDete1 = () => {
return `🔔 पता लगाएँ`
}
const smsDete2 = () => {
return `समूह में कार्रवाईयों की सूचनाएँ`
}
const smsANivel1 = () => {
return `🆙 स्वतः स्तर`
}
const smsANivel2 = () => {
return `सभी को खुद को स्तरवार ऊपर बढ़ाने की अनुमति दें; (स्तर बढ़ाने के लिए पुरस्कार लागू होगा)`
}
const smsRestri1 = () => {
return `⛔ प्रतिबंधित`
}
const smsRestri2 = () => {
return `समूह में लोगों को जोड़ने या हटाने की समर्थन करें`
}
const smsLlamar1 = () => {
return `🚫 एंटी कॉल`
}
const smsLlamar2 = () => {
return `कॉल करने वाले लोगों को अवरोधित करें`
}
const smsAntiSp1 = () => {
return `🚯 एंटी स्पैम`
}
const smsAntiSp2 = () => {
return `किसी के द्वारा कुछ भी अभ्यास करने पर आदेशों का उपयोग निषिद्ध करें`
}
const smsModP1 = () => {
return `🌐 सार्वजनिक मोड`
}
const smsModP2 = () => {
return `सभी को गाता बॉट का उपयोग करने की समर्थन करें`
}
const smsModAd1 = () => {
return `🛂 व्यवस्थापक मोड`
}
const smsModAd2 = () => {
return `केवल व्यवस्थापक गाता बॉट का उपयोग कर सकेंगे`
}
const smsLect1 = () => {
return `✅ स्वचालित पढ़ाई`
}
const smsLect2 = () => {
return `संदेश या चैट्स को पढ़ी छोड़ दें`
}
const smsTempo1 = () => {
return `🐈 अस्थायी बॉट`
}
const smsTempo2 = () => {
return `समूहों में अस्थायी रूप से रहने की अनुमति देता है`
}
const smsStik1 = () => {
return `🎠 स्टिकर`
}
const smsStik2 = () => {
return `सभी को स्वचालित रूप से स्टिकर भेजने की अनुमति दें`
}
const smsStickA1 = () => {
return `🪄 स्वतः स्टिकर`
}
const smsStickA2 = () => {
return `वीडियो, जीफ, छवि, jpg या jpeg लिंक; वे स्वचालित रूप से स्टिकर में बदल जाएंगे`
}
const smsReacc1 = () => {
return `🤡 प्रतिक्रिया `
}
const smsReacc2 = () => {
return `संदेशों को स्वचालित रूप से प्रतिक्रियाएं भेजने की अनुमति दें`
}
const smsAudi1 = () => {
return `🔊 ऑडियो`
}
const smsAudi2 = () => {
return `सभी को स्वचालित रूप से ऑडियो भेजने की अनुमति दें`
}
const smsModHor1 = () => {
return `🔞 सेक्सी मोड`
}
const smsModHor2 = () => {
return `चैट में वयस्क सामग्री दिखाएं`
}
const smsAntitoc1 = () => {
return `☢️ एंटी टॉक्सिक`
}
const smsAntitoc2 = () => {
return `गाली देने वाले लोगों को चेतावनियाँ भेजें`
}
const smsModOb1 = () => {
return `👀 देखें मोड`
}
const smsModOb2 = () => {
return `सभी के लिए दिखाने वाले छवियों, जीफ़ और वीडियो करें`
}
const smsAntiEli1 = () => {
return `🗑️ एंटी डिलीट`
}
const smsAntiEli2 = () => {
return `सभी हटाए गए संदेश चैट या समूह में आगे भेज दिए जाएंगे`
}
const smsAntiInt1 = () => {
return `🌏 एंटी इंटरनेशनल`
}
const smsAntiInt2 = () => {
return `अंतर्राष्ट्रीय नंबर्स को विदेशी समझा जाएगा`
}
const smsAntiE1 = () => {
return `🔗 एंटी लिंक्स`
}
const smsAntiE2 = () => {
return `व्हाट्सएप ग्रुप से लिंक्स भेजने वाले लोगों को हटा दें`
}
const smsAntiEE1 = () => {
return `🔗 एंटी लिंक्स 2`
}
const smsAntiEE2 = () => {
return `व्हाट्सएप पर https शामिल करने वाले लोगों को हटा दें`
}
const smsAntiTT1 = () => {
return `🔗 एंटी टिकटोक`
}
const smsAntiTT2 = () => {
return `टिकटोक से लिंक भेजने वाले लोगों को हटा दें`
}
const smsAntiYT1 = () => {
return `🔗 एंटी यूट्यूब`
}
const smsAntiYT2 = () => {
return `यूट्यूब से लिंक भेजने वाले लोगों को हटा दें`
}
const smsAntiTEL1 = () => {
return `🔗 एंटी टेलीग्राम`
}
const smsAntiTEL2 = () => {
return `टेलीग्राम से लिंक भेजने वाले लोगों को हटा दें`
}
const smsAntiFB1 = () => {
return `🔗 एंटी फेसबुक`
}
const smsAntiFB2 = () => {
return `फेसबुक लिंक भेजने वाले लोगों को हटा दें`
}
const smsAntiIG1 = () => {
return `🔗 एंटी इंस्टाग्राम`
}
const smsAntiIG2 = () => {
return `इंस्टाग्राम लिंक भेजने वाले लोगों को हटा दें`
}
const smsAntiTW1 = () => {
return `🔗 एंटी ट्विटर `
}
const smsAntiTW2 = () => {
return `ट्विटर लिंक भेजने वाले लोगों को हटा दें`
}
const smsSOLOP1 = () => {
return `⚜️ केवल निजी`
}
const smsSOLOP2 = () => {
return `इसे केवल निजी चैट में उपयोग करने की अनुमति दें`
}
const smsSOLOG1 = () => {
return `⚜️ केवल समूह`
}
const smsSOLOG2 = () => {
return `इसे केवल समूह चैट में उपयोग करने की अनुमति दें`
}
const smsConfi1 = () => {
return `सेटिंग्स`
}
const smsConfi2 = () => {
return `*नमस्ते!*`
}
const smsConfi3 = () => {
return `┃ *सूची से एक विकल्प चुनें*`
}
const smsConfi4 = () => {
return `┃ *विन्यास शुरू करने के लिए*`
}
const smsConfi5 = () => {
return `┃● *विन्यास सूचनाएं:*`
}
const smsConfi6 = () => {
return `┃ ✅ ⇢ *समारोह सक्रिय*`
}
const smsConfi7 = () => {
return `┃ ❌ ⇢ *समारोह अक्षम*`
}
const smsConfi8 = () => {
return `┃ ⚠️ ⇢ *यह चैट समूह नहीं है*`
}
const smsConfi9 = () => {
return `┃ *सिफारिश: विन्यास देखने के लिए*\n┃ *पूरा इस समूह मेनू का उपयोग करें*\n┃`
}
const smsConfi10 = () => {
return `*~ विन्यास केंद्र*`
}
const smsParaAdmins = () => {
return `व्यवस्थापक और निर्माता के लिए: समूह`
}
const smsParaAdYOw = () => {
return `व्यवस्थापक और निर्माता के लिए: चैट`
}
const smsParaOw = () => {
return `निर्माता के लिए: चैट`
}
const smsNoGg = () => {
return ` | ⚠️`
}
const smsMens1 = () => {
return `आदेश`
}
const smsMens2 = () => {
return `वर्तमान में`
}
const smsMens3 = () => {
return `इसमें`
}
const smsMens4 = () => {
return `बॉट`
}
const smsMens5 = () => {
return `चैट`
}

//Error2
const smsMensError1 = () => {
return `❕ कमांड रिपोर्ट ❕`
}
const smsMensError2 = () => {
return `निम्नलिखित कमांड में त्रुटि हो रही है`
}

//_antiviewonce.js
const smsAntiView = () => {
return `*कुछ भी छुपाया नहीं जा सकता* 😎`
}

//_autolevelup.js
const smsAutoLv1 = () => {
return `🎖️ नया स्तर 🎖️`
}
const smsAutoLv2 = () => {
return `पिछला स्तर:`
}
const smsAutoLv3 = () => {
return `वर्तमान स्तर:`
}
const smsAutoLv4 = () => {
return `रेंज:`
}
const smsAutoLv5 = () => {
return `तारीख:`
}
const smsAutoLv6 = () => {
return `आपने एक नया स्तर प्राप्त किया है!!!`
}
const smsAutoLv7 = () => {
return `🥳 आपके नए स्तर के लिए इनाम`
}

//_autosticker.js
const smsAutoStik = () => {
return `${lenguajeGB['smsAvisoFG']()}*वीडियो 7 सेकंड से ज्यादा नहीं होना चाहिए।*`
}

//_expired.js
const smsBottem1 = () => {
return `*समूह छोड़ देता है!!! 🤝 अगर आप चाहते हैं कि वह समूह वापस आए, समूह में वापस आने के लिए कमांड _#bottemporal_ का उपयोग करें!!*`
}
const smsBottem2 = () => {
return `*💕 उपयोगकर्ता सहायता*\n*_${global.ig}_*\n`
}
const smsBottem3 = () => {
return `जल्दी मिलते हैं 💖`
}

//_premium.js
const smsPremI = () => {
return `*आपका प्रीमियम समय समाप्त हो गया है!* 🎟️\n*नए प्रीमियम पास प्राप्त करने के लिए कमांड का उपयोग करें:*\n*#pass prem*`
}

//afk-_afk.js
const smsAfkM1 = () => {
return `${lenguajeGB['smsAvisoEG']()}*आपने बेकार रहना बंद कर दिया है AFK*`
}
const smsAfkM2 = () => {
return `*निष्क्रियता का कारण था:*`
}
const smsAfkM3 = () => {
return `*निष्क्रियता का समय:*`
}
const smsAfkM4 = () => {
return `${lenguajeGB['smsAvisoAG']()}*इस उपयोगकर्ता को टैग न करें!! वे निष्क्रिय हैं*`
}
const smsAfkM5 = () => {
return `*निष्क्रियता के कारण:*`
}
const smsAfkM6 = () => {
return `*निष्क्रियता के कारण AFK: निष्क्रियता के कारण का निर्दिष्ट नहीं किया गया*`
}

//afk-afk.js
const smsAfkM1A = () => {
return `${lenguajeGB['smsAvisoAG']()}*न टैग करें*`
}
const smsAfkM1B = () => {
return `*निष्क्रिय रहेंगे AFK*\n\n*निष्क्रियता का कारण*`
}

//anonymous_chat.js
const smsChatAn1 = () => {
return `${lenguajeGB['smsAvisoFG']()}*आप गुमनाम चैट में नहीं हैं*`
}
const smsChatAn2 = () => {
return `*यदि आप गुमनाम चैट शुरू करना चाहते हैं तो #start कमांड का उपयोग करें या नीचे दिए गए बटन का उपयोग करें*\n`
}
const smsChatAn3 = () => {
return `⚡ गुमनाम चैट शुरू करें`
}
const smsChatAn4 = () => {
return `${lenguajeGB['smsAvisoRG']()}🪐 *आपने गुमनाम चैट छोड़ दी है*`
}
const smsChatAn5 = () => {
return `${lenguajeGB['smsAvisoAG']()}*दूसरा उपयोगकर्ता गुमनाम चैट छोड़ दिया है*`
}
const smsChatAn6 = () => {
return `*यदि आप दूसरे गुमनाम चैट में जाना चाहते हैं तो #start कमांड का उपयोग करें या नीचे दिए गए बटन का उपयोग करें*\n`
}
const smsChatAn7 = () => {
return `${lenguajeGB['smsAvisoAG']()}*आप अभी भी गुमनाम चैट में हैं या किसी दूसरे उपयोगकर्ता की चैट का इंतजार कर रहे हैं, कृपया धैर्य रखें*`
}
const smsChatAn8 = () => {
return `*यदि आप गुमनाम चैट से बाहर निकलना चाहते हैं तो #leave कमांड का उपयोग करें या नीचे दिए गए बटन का उपयोग करें*\n`
}
const smsChatAn9 = () => {
return `🍁 गुमनाम चैट से बाहर निकलें`
}
const smsChatAn10 = () => {
return `${lenguajeGB['smsAvisoEG']()}✨ *वे अब चैट कर सकते हैं*`
}
const smsChatAn11 = () => {
return `*कोई गुमनाम चैट में शामिल हुआ है!!*`
}
const smsChatAn12 = () => {
return `❇️ दूसरा उपयोगकर्ता`
}
const smsChatAn13 = () => {
return `${lenguajeGB['smsAvisoRG']()}🐈 *किसी दूसरे उपयोगकर्ता को गुमनाम चैट में शामिल होने का इंतजार कर रहे हैं, कृपया धैर्य रखें*`
}

//Botones de Menú
const smsBotonM1 = () => {
return `⚡ मेनू शुरू करें ⚡`
}
const smsBotonM2 = () => {
return `💫 पूर्ण मेनू 💫`
}
const smsBotonM3 = () => {
return `🎒 इन्वेंट्री 🎒`
}
const smsBotonM4 = () => {
return `उपयोगकर्ता`
}
const smsBotonM5 = () => {
return `रैंक`
}
const smsBotonM6 = () => {
return `स्तर`
}
const smsBotonM7 = () => {
return `प्रीमियम`
}
const smsTex1 = () => {
return '*मेनू खोजें*'
}
const smsTex2 = () => {
return '*ऑडियो संशोधक*'
}
const smsTex3 = () => {
return '*मेनू +18*'
}
const smsTex4 = () => {
return '*गतिशील सामग्री*'
}
const smsTex5 = () => {
return '*खोज करें और डाउनलोड करें*'
}
const smsTex6 = () => {
return '*मेनू +18 प्रीमियम*'
}
const smsTex7 = () => {
return '⠇ *इमेजेज +18 गुणवत्ता और विविधता*\n⠇ *वीडियो +18 सिर्फ आपके लिए*\n⠇ *स्टिकर +18 उपलब्ध*'
}
const smsTex8 = () => {
return '*कन्वर्टर मेनू*'
}
const smsTex9 = () => {
return '*डाउनलोड मेनू*'
}
const smsTex10 = () => {
return '*गतिशील खेल मेनू*'
}
const smsTex11 = () => {
return '*समूहों के लिए मेनू*'
}
const smsTex12 = () => {
return '*उपकरण मेनू*'
}
const smsTex13 = () => {
return '*जानकारी मेनू*'
}
const smsTex14 = () => {
return '*प्रभाव और लोगो मेनू*'
}
const smsTex15 = () => {
return '*लोगो मेनू 2*'
}
const smsTex16 = () => {
return 'ऑडियो मेनू'
}
const smsTex17 = () => {
return '*ऑडियो में प्रिफिक्स उपयोग करना आवश्यक नहीं है*'
}
const smsTex18 = () => {
return 'साउंड सूची'
}
const smsTex19 = () => {
return '*आप ऑडियो का चयन कर सकते हैं!!*'
}
const smsTex20 = () => {
return '*मालिक मेनू*'
}
const smsTex21 = () => {
return '*भू-कथा मेनू*'
}
const smsTex22 = () => {
return '*स्टिकर और फ़िल्टर मेनू*'
}
const smsTex23 = () => {
return '*यादृच्छिक मीम और एनिमे मेनू*'
}

//info-grupos-lista.js
const smsLisA = () => {
return '_*आप इन समूहों में हैं:*_'
}
const smsLisB = () => {
return '*⭔ कुल समूह:*'
}
const smsLisC = () => {
return '*⋄ समूह:*'
}
const smsLisD = () => {
return '*⋄ आईडी:*'
}
const smsLisE = () => {
return '*⋄ सहभागियों की संख्या:*'
}

//ad
const smsMalused = () => {
return '⚡ *इस प्रकार से कमांड का उपयोग करें:*\n'
}
const smsMalused2 = () => {
return `${lenguajeGB['smsAvisoMG']()}🐈 *आपको इस उदाहरण के अनुसार कमांड का उपयोग करना चाहिए:*\n`
}
const smsMalused3 = () => {
return `${lenguajeGB['smsAvisoMG']()}🐈 *आपको इस उदाहरण के अनुसार कमांड का उपयोग करना चाहिए या किसी के संदेश का जवाब देना चाहिए:*\n`
}

//gc-config_time.js
const smsGrupoTime1 = () => {
return '🔓 *_एक घंटे में समूह खोलें_*'
}
const smsGrupoTime2 = () => {
return '🔒 *_एक घंटे में समूह बंद करें_*'
}
const smsGrupoTime3 = () => {
return '*समूह'
}
const smsGrupoTime4 = () => {
return 'बंद'
}
const smsGrupoTime5 = () => {
return 'खुला'
}
const smsGrupoTime6 = () => {
return '*के दौरान'
}
const smsGrupoTime7 = () => {
return '🔒 *समूह बंद है, केवल एडमिन्स मैसेज भेज सकते हैं*'
}
const smsGrupoTime8 = () => {
return '🔓 *समूह खुला है, सभी मैसेज भेज सकते हैं*'
}
const smsGrupoTime9 = () => {
return '🔓 खुला समूह दौरान '
}
const smsGrupoTime10 = () => {
return '🔒 बंद समूह दौरान '
}
const smsGrupoTime11 = () => {
return ' घंटे'
}
const smsGrupoTime12 = () => {
return ' समूह को खुले रखने की अनुमति दें '
}
const smsGrupoTime13 = () => {
return ' समूह को बंद करने की अनुमति दें '
}

//grupo-add.js
const smsAddB1 = () => {
return `${lenguajeGB['smsAvisoFG']()}*नंबर जोड़ा नहीं जा सकता, कृपया सत्यापित करें कि वह सही है, शायद हाल ही में निकल गया है या आपका गोपनीयता सेट किया गया है।*`
}
const smsAddB2 = () => {
return `${lenguajeGB['smsAvisoFG']()}*नंबर जोड़ा नहीं जा सकता, कृपया सत्यापित करें कि वह सही है, या उसे मैन्युअल रूप से जोड़ें।*`
}

//grupo-admins.js
const smsAddB3 = () => {
return `*एडमिन्स के लिए सूचना*`
}
const smsAddB4 = () => {
return `*एडमिन प्रस्तुति*`
}
const smsAddB5 = () => {
return `*संदेश:*`
}
const smsAddB6 = () => {
return `मैं अनुरोध करता हूँ कि एडमिन्स कृपया।`
}

//grupo-advertencia.js
const smsAdveu1 = () => {
return `${lenguajeGB['smsAvisoAG']()}*यह केवल उस फंक्शन को सक्रिय करने पर ही उपयोग कर सकते हैं:*\n`
}
const smsAdveu2 = () => {
return 'कारण'
}
const smsAdveu3 = () => {
return `${lenguajeGB['smsAvisoMG']()}*चेतावनी के लिए कारण लिखना न भूलें*\n`
}
const smsAdveu4 = () => {
return '*इस समूह में चेतावनी प्राप्त हुई है!!*'
}
const smsAdveu5 = () => {
return 'चेतावनी'
}
const smsAdveu6 = () => {
return '🎒 इन्वेंट्री'
}
const smsAdveu7 = () => {
return '*मैंने आपको कई बार चेतावनी दी थी!!*'
}
const smsAdveu8 = () => {
return '*अब आपको हटा दिया जाएगा* 🙄'
}
const smsAdveu9 = () => {
return '😇 धन्यवाद'
}
const smsAdveu10 = () => {
return '*इस समूह में एक चेतावनी हटा दी गई!!*'
}
const smsAdveu11 = () => {
return 'पहले:'
}
const smsAdveu12 = () => {
return 'अब:'
}

//grupo-demote.js || grupo-promote.js
const smsDemott = () => {
return `*यह नंबर अमान्य है, कृपया फिर से कोशिश करें, किसी के संदेश का उत्तर दें या इस उदाहरण के तरीके से उपयोग करें:*\n`
}
const smsDemott2 = () => {
return '*अब इस समूह में पावर है!!*'
}
const smsDemott3 = () => {
return '*इस समूह में अब पावर नहीं है!!*'
}

//grupo-info.js
const smsGI1 = () => {
return '*समूह की जानकारी*'
}
const smsGI2 = () => {
return '*समूह आईडी*'
}
const smsGI3 = () => {
return '*समूह का नाम*'
}
const smsGI4 = () => {
return '*समूह की विवरण*'
}
const smsGI5 = () => {
return '*कोई विवरण नहीं*'
}
const smsGI6 = () => {
return '*उपयोगकर्ताओं की संख्या*'
}
const smsGI7 = () => {
return '*उपयोगकर्ता*'
}
const smsGI8 = () => {
return '*समूह का सृजक*'
}
const smsGI9 = () => {
return '*समूह के एडमिन*'
}
const smsGI10 = () => {
return '⚙️ समूह सेटिंग्स'
}

//grupo-kick.js
const smskick1 = () => {
return `${lenguajeGB['smsAvisoAG']()}*व्यक्ति को टैग करें या व्यक्ति के संदेश का उत्तर दें, जिसे आप हटाना चाहते हैं*\n\n*उदाहरण: `
}
const smskick2 = () => {
return `टूक दिया गया 😼🫵`
}
const smskick3 = () => {
return `मैं समूह सृजक को हटा नहीं सकता 😆🫵`
}
const smskick4 = () => {
return `इस समूह में नहीं है 👻`
}

//grupo-tagall.js
const smstagaa = () => {
return `⚡ समूह को बुलाना ⚡`
}

//grupo-setbye.js
const smsSetB = () => {
return `${lenguajeGB['smsAvisoEG']()}*समूह का विदाई संदेश विन्यासित हो गया है*`
}
const smsSetB2 = () => {
return `${lenguajeGB['smsAvisoIIG']()}🙌 *_विदाई संदेश लिखें_*\n*_आप अधिक जानकारी जोड़ने के लिए "@" का उपयोग कर सकते हैं:_*\n\n*⚡ @user (उपयोगकर्ता को उल्लेख करें)*\n\n*ध्यान दें कि "@" वैकल्पिक हैं*`
}

//grupo-setwelcome.js
const smsSetW = () => {
return `${lenguajeGB['smsAvisoEG']()}*समूह स्वागत विन्यासित हो गया है*`
}
const smsSetW2 = () => {
return `${lenguajeGB['smsAvisoIIG']()}🙌 *_स्वागत संदेश लिखें_*\n*_आप अधिक जानकारी जोड़ने के लिए "@" का उपयोग कर सकते हैं:_*\n\n*⚡ @user (उपयोगकर्ता को उल्लेख करें)*\n*⚡ @subject (समूह का नाम)*\n*⚡ @desc (समूह की विवरण)*\n\n*ध्यान दें कि "@" वैकल्पिक हैं*`
}

//grupo-setdesc.js
const smsDest = () => {
return `${lenguajeGB['smsAvisoEG']()}*समूह की विवरण विन्यासित हो गया है*`
}

//grupo-setname.js
const smsNam1 = () => {
return `${lenguajeGB['smsAvisoEG']()}*समूह का नाम विन्यासित हो गया है*`
}
const smsNam2 = () => {
return `${lenguajeGB['smsAvisoMG']()}*🙌 नए समूह का नाम लिखें*`
}
const smsNam3 = () => {
return `${lenguajeGB['smsAvisoFG']()}*समूह का नाम 25 अक्षरों से अधिक नहीं होना चाहिए*`
}

//grupo-restaurarEnlace.js
const smsRestGp = () => {
return `${lenguajeGB['smsAvisoEG']()}*समूह लिंक रीसेट किया गया है*`
}

//Button
const smsSig = () => {
return `➡️ अगला ➡️`
}
const smsSigPrem = () => {
return `❤️‍🔥 अगला ❤️‍🔥`
}
const smsCont18Porn = () => {
return `🔞 *सामग्री* 🔞`
} //texto
const smsCont18Porn2 = () => {
return `🔞 सामग्री 🔞`
} //texto
const smsCont18PornP = () => {
return `🌟 *सामग्री ❤️‍🔥 प्रीमियम* 🌟`
} //texto
const smsCont18PornP2 = () => {
return `सामग्री ❤️‍🔥 प्रीमियम`
} //texto

//propietario(a).js
const smsBCMensaje = (usedPrefix, command) => {
return `*संदेश का उत्तर दें या इस्तेमाल किया गया संदेश ${usedPrefix + command}*`
}
const smsBCMensaje2 = () => {
return `*आधिकारिक संदेश भेजा गया, कृपया थोड़ी देर प्रतीक्षा करें...*`
}
const smsBCMensaje3 = (totalPri, time) => {
return `✅ *संदेश भेजा गया   ${totalPri} निजी चैटों को*\n\n*कुल भेजने का समय : ${time}*\n${totalPri >= 3000 ? '\n*सभी चैटों में भेजे जाने से बचने के लिए नहीं भेजे गए*' : ''}`
}

//propietario(a).js
const smsPropban1 = (usedPrefix, command, bot) => {
return `${lenguajeGB['smsAvisoMG']()}*किसी का टैग करें या प्रतिक्रिया दें या संदेश से लिखें जिसे आप कमांड से बैन करना चाहते हैं*\n\n*उदाहरण:*\n*${usedPrefix + command} @${bot}*`
}
const smsPropban2 = (bot) => {
return `${lenguajeGB['smsAvisoFG']()}*@${bot} इस कमांड के साथ बैन नहीं किया जा सकता* 😹`
}
const smsPropban3 = (ownerNumber) => {
return `${lenguajeGB.smsAvisoIIG()}😳 *मैं ${packname} के मालिक @${ownerNumber} को बैन नहीं कर सकता*`
}
const smsPropban4 = (number) => {
return `${lenguajeGB.smsAvisoIIG()}*बैन दोबारा करने की आवश्यकता नहीं है @${number} हां यह पहले ही है* 😊`
}
const smsPropban5 = () => {
return `${lenguajeGB['smsAvisoEG']()}*उपयोगकर्ता सफलतापूर्वक बैन हो गया* 🙀`
}
const smsPropban6 = (number, usr) => {
return `${lenguajeGB.smsAvisoAG()}*@${number} आप @${usr} द्वारा बैन हो गए हैं आप कोई कमांड का उपयोग नहीं कर सकते जब तक कोई बैन को रिवर्स नहीं कर देता* 😿`
}
const smsPropban7 = (usedPrefix, command, number) => {
return `${lenguajeGB['smsAvisoFG']()}*एक त्रुटि आई है, शायद उपयोगकर्ता मेरे डेटाबेस में नहीं है, कृपया लिखें ${usedPrefix + command} ${number}*\n\`\`\`यदि त्रुटि जारी रहती है तो इस कमांड की सूचना करें\`\`\``
}

//propietario(a).js
const smsBCbot1 = () => {
return `✅ *संदेश:*`
}
const smsBCbot2 = () => {
return `निजी `
}
const smsBCbot3 = () => {
return `समूह`
}
const smsBCbot4 = () => {
return `कुल`
}
const smsBCbot5 = () => {
return `कुल भेजने का समय :`
}
const smsBCbot6 = () => {
return `सभी चैटों में भेजे जाने से बचने के लिए नहीं भेजे गए`
}
const smsBCbot7 = () => {
return `✅ *आधिकारिक संदेश* ✅`
}

//propietario(a).js
const smsChatGP1 = () => {
return '*संदेश भेज दिया गया है, थोड़ी देर प्रतीक्षा करें...*'
}
const smsChatGP2 = (readMS, dia, mes, año, fecha, tiempo) => {
return `✅ *आधिकारिक संदेश* ✅\n${readMS}\n\`\`\`${dia}, ${mes} ${año}\`\`\`\n\`\`\`${fecha} || ${tiempo}\`\`\`\n\n`
}
const smsChatGP3 = (totalGP) => {
return `✅ *संदेश को  ${totalGP} समूहों को भेजा गया*`
}

//jadibot-serbot.js
const smsIniJadi = () => {
return `*⊹ • • • ミ★ ${global.packname} ミ★• • • ⊹*\n\n*ღ ${global.packname} का संस्करण » _${global.vs}_*\n*ღ JadiBot का संस्करण » _${global.vsJB}_*\n\n🟢 *_सब बॉट बनने का काम_* 🟢\n\n*➡️ दूसरे मोबाइल फोन या पीसी के साथ, स्कैन करें QR ताकि सब बॉट बन सकें*\n\n*1️⃣ ऊपरी दाईं ओर तीन बिंदुओं पर जाएं*\n*2️⃣ पेयर्ड डिवाइस विकल्प पर जाएं*\n*3️⃣ स्कैन करें QR कोड लॉगिन करने के लिए*\n\n📢 *यह QR कोड 45 सेकंड में समाप्त हो जाता है!*`
}
const smsIniJadi2 = () => {
return `*⊹ • • • ミ★ ${global.packname} ミ★• • • ⊹*

*ღ का संस्करण ${global.packname} » _${global.vs}_*
*ღ JadiBot का संस्करण » _${global.vsJB}_*

🟢 *_अपने आप को एक सब बॉट बनाने का नया कार्य_* 🟢

➡️ दूसरे मोबाइल फोन या पीसी के साथ, स्कैन करें QR ताकि सब बॉट बन सकें*\n\n*1️⃣ ऊपरी दाईं ओर तीन बिंदुओं पर जाएं*\n*2️⃣ पेयर्ड डिवाइस विकल्प पर जाएं*\n*3️⃣ स्कैन करें QR कोड लॉगिन करने के लिए*\n\n📢 *यह QR कोड 45 सेकंड में समाप्त हो जाता है!*`
}
const smsJBConexionClose2 = () => {
return `${lenguajeGB['smsAvisoFG']()}🔴 *आपकी डिवाइस डिस्कनेक्ट हो चुकी है*\n\n*उपयोग करने के लिए आपको फिर से कनेक्ट करना होगा:\n#deletesesion`
}
const smsreenvia = () => {
return `*🟢 आदेश पुनः भेजें....*`
}
const smsSoloOwnerJB = () => {
return `${lenguajeGB['smsAvisoAG']()}*यह कमांड मेरे मालिक द्वारा अक्षम किया गया है*`
}
const smsJBPrincipal = () => {
return `${lenguajeGB['smsAvisoAG']()}🔵 *सब बॉट बनने के लिए मुख्य नंबर पर जाएं*\n*ღ निम्नलिखित लिंक पर जाएं:*\n`
}
const smsJBConexion = () => {
return `${lenguajeGB['smsAvisoFG']()}🟡 *जबरदस्त तरीके से कनेक्शन बंद हो गया है, हम फिर से कनेक्ट करने का प्रयास करेंगे...*`
}
const smsJBConexionClose = () => {
return `${lenguajeGB['smsAvisoFG']()}🔴 *कनेक्शन बंद हो गया है, आपको नए QR कोड के साथ मैन्युअल रूप से कनेक्ट करना होगा #jadibot कमांड का उपयोग करके*`
}
const smsJBConexionTrue = () => {
return `${lenguajeGB['smsAvisoEG']()}🟢 *सफल कनेक्शन!!!*`
}
const smsJBConexionTrue2 = () => {
return `${lenguajeGB['smsAvisoEG']()}🟢 *सफल कनेक्शन!!! आप यह उपयोग करके कनेक्ट कर सकते हैं:*`
}
const smsJBCargando = () => {
return `${lenguajeGB['smsAvisoIIG']()}⚪ *कनेक्टेड हैं!! कृपया प्रतीक्षा करें संदेश लोड हो रहे हैं...*\n\n♻️ *उपलब्ध विकल्प:*\n*» #stop _(सब बॉट फ़ीचर को रोकें)_*\n*» #deletesesion _(सभी सब बॉट के निशान हटाएं)_*\n*» #jadibot _(सब बॉट बनने के लिए नए QR कोड प्राप्त करें)_`
}
const smsJBInfo1 = () => {
return `💖 उपयोगी लिंक`
}
const smsJBInfo2 = () => {
return `💖 यह फ़ंक्शन स्थिर है, यदि इसमें कोई असुविधा हो तो कृपया संपर्क करें ईमेल: centergatabot@gmail.com\n💝 आप PayPal के माध्यम से स्वैच्छिक रूप से दान कर सकते हैं: ${global.paypal}\n\nआपका धन्यवाद ${global.packname} के समर्थन के लिए*`
}

//jadibot-deleteSesion.js
const smsJBDel = () => {
return `${lenguajeGB['smsAvisoAG']()}*इस कमांड को मुख्य बॉट के साथ उपयोग करें*`
}
const smsJBAdios = () => {
return `${lenguajeGB['smsAvisoEG']()}*मुझे आपकी याद आएगी, ${global.packname} अलविदा!! 🥹*`
}
const smsJBCerrarS = () => {
return `${lenguajeGB['smsAvisoEG']()}*आपने लॉगआउट कर दिया है और सभी ट्रेस हटा दी हैं*`
}
const smsJBErr = () => {
return `*आप उप-बॉट के रूप में लॉगआउट हो गए हैं* ♻️`
}

//comandos+18-adult.js
const smsContAdult = () => {
return `${lenguajeGB['smsAvisoAG']()}*यहां गरमागरम कमांड्स अक्षम हैं, अगर आप मेरे मालिक हैं तो #on modohorny का उपयोग करें*`
}

//comandos+18-menu.js
const smsList1 = () => {
return `पर्याप्त नहीं हैं `
}
const smsList2 = () => {
return `\nखरीदने के लिए यहां क्लिक करें `
}
const smsList3 = () => {
return `उपलब्ध सामग्री 😸`
}
const smsList4 = () => {
return `सामग्री उपलब्ध नहीं 😿\nखरीदने के लिए यहां क्लिक करें `
}
const smsList5 = () => {
return `*एक विकल्प चुनें*\n*सामग्री देखने के लिए*\n*सूची से* 😋`
}
const smsList6 = () => {
return `👀 सूची देखें 👀`
}

//descargas-consejos.js
const smsConj = () => {
return `🍃 नया सलाह`
}
const smsFras = () => {
return `🍃 नई वाक्यशृंखला`
}

//info-contacto.js
const smsContacto1 = () => {
return 'मैं ' + packname + ' एक WhatsApp बॉट हूँ, मैं आपकी हर सहायता करने के लिए समर्पित हूँ 😎'
}
const smsContacto2 = () => {
return 'मैं ' + packname + ' का मालिक हूँ, अगर आपके पास कोई सवाल है तो आप मुझसे कह सकते हैं ✌️'
}
const smsContacto3 = () => {
return '👑 मालिक'
}
const smsContacto4 = () => {
return 'गटाबॉट आधिकारिक संपर्क 🐈'
}
const smsContacto5 = () => {
return '🐣 मैं आपकी कैसे मदद कर सकता हूँ?'
}
const smsContacto6 = () => {
return 'मेरे पास मेल नहीं है 🙏'
}
const smsContacto7 = () => {
return '🌎 वैश्विक'
}
const smsContacto8 = () => {
return 'यह खाता बॉट है 👀'
}

export default {
lenguaje,
smsAvisoRG,
smsPropban1,
smsPropban2,
smsPropban3,
smsPropban4,
smsPropban5,
smsPropban6,
smsPropban7,
smsLisA,
smsLisB,
smsLisC,
smsLisD,
smsLisE,
smsChatGP1,
smsChatGP2,
smsChatGP3,
smsBCMensaje,
smsBCMensaje2,
smsBCMensaje3,
smsAvisoAG,
smsAvisoIIG,
smsBCbot1,
smsBCbot2,
smsBCbot3,
smsBCbot4,
smsBCbot5,
smsBCbot6,
smsBCbot7,
smsAvisoFG,
smsAvisoMG,
smsAvisoEEG,
smsAvisoEG,
smsRowner,
smsOwner,
smsMods,
smsPremium,
smsGroup,
smsPrivate,
smsAdmin,
smsBotAdmin,
smsUnreg,
smsRestrict,
smsTime,
smsUptime,
smsVersion,
smsTotalUsers,
smsMode,
smsModePublic,
smsModePrivate,
smsBanChats,
smsBanUsers,
smsPareja,
smsResultPareja,
smsSaludo,
smsDia,
smsTarde,
smsTarde2,
smsNoche,
smsListaMenu,
smsLista1,
smsLista2,
smsLista3,
smsLista4,
smsLista5,
smsLista6,
smsLista7,
smsLista8,
smsLista9,
smsLista10,
smsLista11,
smsLista12,
smsLista13,
smsLista14,
smsLista15,
smsLista16,
smsLista17,
smsLista18,
smsLista19,
smsLista20,
smsLista21,
smsLista22,
smsLista23,
smsLista24,
smsLista25,
smsLista26,
smsLista27,
smsLista28,
smsLista29,
smsLista30,
smsLista31,
smsLista32,
smsLista33,
smsLista34,
smsLista35,
smsWelcome,
smsBye,
smsSpromote,
smsSdemote,
smsSdesc,
smsSsubject,
smsSicon,
smsSrevoke,
smsConexion,
smsClearTmp,
smsCargando,
smspurgeSession,
smspurgeOldFiles,
smspurgeSessionSB1,
smspurgeSessionSB2,
smspurgeSessionSB3,
smspurgeOldFiles1,
smspurgeOldFiles2,
smspurgeOldFiles3,
smspurgeOldFiles4,
smsTextoYT,
smsApagar,
smsEncender,
smsEnlaceTik,
smsEnlaceYt,
smsEnlaceTel,
smsEnlaceFb,
smsEnlaceIg,
smsEnlaceTw,
smsAllAdmin,
smsSoloOwner,
smsCont1,
smsCont2,
smsCont3,
smsCont4,
smsCont5,
smsCont6,
smsCont7,
smsCont8,
smsCont9,
smsCont10,
smsCont11,
smsCont12,
smsCont13,
smsCont14,
smsCont15,
smsCont16,
smsCont17,
smsCont18,
smsCont19,
smsCont20,
smsCont21,
smsInt1,
smsInt2,
smsAdwa,
smsEnlaceWat,
smsEnlaceWatt,
smsNoSpam,
smsNoSpam2,
smsConMenu,
smsMalError,
smsMalError2,
smsMalError3,
smsToxic1,
smsToxic2,
smsToxic3,
smsToxic4,
smsToxic5,
smsToxic6,
smsToxic7,
eExp,
eDiamante,
eDiamantePlus,
eToken,
eEsmeralda,
eJoya,
eMagia,
eOro,
eGataCoins,
eGataTickers,
eEnergia,
ePocion,
eAgua,
eBasura,
eMadera,
eRoca,
ePiedra,
eCuerda,
eHierro,
eCarbon,
eBotella,
eLata,
eCarton,
eEletric,
eBarraOro,
eOroComun,
eZorroG,
eBasuraG,
eLoboG,
eMaderaG,
eEspada,
eCarnada,
eBillete,
ePinata,
eGancho,
eCanaPescar,
eCComun,
ePComun,
eCMistica,
eCMascota,
eCJardineria,
eClegendaria,
eUva,
eManzana,
eNaranja,
eMango,
ePlatano,
eSUva,
eSManzana,
eSNaranja,
eSMango,
eSPlatano,
eCentauro,
eAve,
eGato,
eDragon,
eZorro,
eCaballo,
eFenix,
eLobo,
ePerro,
eAMascots,
eCCentauro,
eCAve,
eCMagica,
eCDragon,
eACaballo,
eCFenix,
smsWel1,
smsWel2,
smsParaAdmins,
smsDete1,
smsDete2,
smsANivel1,
smsANivel2,
smsParaAdYOw,
smsParaOw,
smsRestri1,
smsRestri2,
smsLlamar1,
smsLlamar2,
smsModP1,
smsModP2,
smsModAd1,
smsModAd2,
smsLect1,
smsLect2,
smsTempo1,
smsTempo2,
smsStik1,
smsStik2,
smsStickA1,
smsStickA2,
smsReacc1,
smsReacc2,
smsAudi1,
smsAudi2,
smsModHor1,
smsModHor2,
smsAntitoc1,
smsAntitoc2,
smsModOb1,
smsModOb2,
smsAntiEli1,
smsAntiEli2,
smsAntiInt1,
smsAntiInt2,
smsAntiE1,
smsAntiE2,
smsAntiEE1,
smsAntiEE2,
smsAntiTT1,
smsAntiTT2,
smsAntiYT1,
smsAntiYT2,
smsAntiTEL1,
smsAntiTEL2,
smsAntiFB1,
smsAntiFB2,
smsAntiIG1,
smsAntiIG2,
smsAntiTW1,
smsAntiTW2,
smsSOLOP1,
smsSOLOP2,
smsSOLOG1,
smsSOLOG2,
smsNoGg,
smsConfi1,
smsConfi2,
smsConfi3,
smsConfi4,
smsConfi5,
smsConfi6,
smsConfi7,
smsConfi8,
smsConfi9,
smsConfi10,
smsMens1,
smsMens2,
smsMens3,
smsMens4,
smsMens5,
smsMensError1,
smsMensError2,
smsAntiView,
smsAutoLv1,
smsAutoLv2,
smsAutoLv3,
smsAutoLv4,
smsAutoLv5,
smsAutoLv6,
smsAutoLv7,
smsAntiSp1,
smsAntiSp2,
smsAutoStik,
smsBottem1,
smsBottem2,
smsBottem3,
smsPremI,
smsAfkM1,
smsAfkM2,
smsAfkM3,
smsAfkM4,
smsAfkM5,
smsAfkM6,
smsAfkM1A,
smsAfkM1B,
smsChatAn1,
smsChatAn2,
smsChatAn3,
smsChatAn4,
smsChatAn5,
smsChatAn6,
smsChatAn7,
smsChatAn8,
smsChatAn9,
smsChatAn10,
smsChatAn11,
smsChatAn12,
smsChatAn13,
smsBotonM1,
smsBotonM2,
smsBotonM3,
smsBotonM4,
smsBotonM5,
smsBotonM6,
smsBotonM7,
smsTex1,
smsTex2,
smsTex3,
smsTex4,
smsTex5,
smsTex6,
smsTex7,
smsTex8,
smsTex9,
smsTex10,
smsTex11,
smsTex12,
smsTex13,
smsTex14,
smsTex15,
smsTex16,
smsTex17,
smsTex18,
smsTex19,
smsTex20,
smsTex21,
smsTex22,
smsTex23,
smsMalused,
smsGrupoTime1,
smsGrupoTime2,
smsGrupoTime3,
smsGrupoTime4,
smsGrupoTime5,
smsGrupoTime6,
smsGrupoTime7,
smsGrupoTime8,
smsGrupoTime9,
smsGrupoTime10,
smsGrupoTime11,
smsGrupoTime12,
smsGrupoTime13,
smsAddB1,
smsAddB2,
smsAddB3,
smsAddB4,
smsAddB5,
smsAddB6,
smsAdveu1,
smsMalused2,
smsAdveu2,
smsAdveu3,
smsAdveu4,
smsAdveu5,
smsAdveu6,
smsAdveu7,
smsAdveu8,
smsAdveu9,
smsMalused3,
smsAdveu10,
smsAdveu11,
smsAdveu12,
smsDemott,
smsDemott2,
smsDemott3,
smsGI1,
smsGI2,
smsGI3,
smsGI4,
smsGI5,
smsGI6,
smsGI7,
smsGI8,
smsGI9,
smsGI10,
smsLista22_1,
smsCodigoQR,
smsConexionOFF,
smskick1,
smskick2,
smskick3,
smskick4,
smstagaa,
smsSetB,
smsSetB2,
smsSetW,
smsSetW2,
smsDest,
smsNam1,
smsNam2,
smsNam3,
smsRestGp,
smsSig,
smsSigPrem,
smsCont18Porn,
smsCont18Porn2,
smsCont18PornP,
smsCont18PornP2,
smsIniJadi,
smsSoloOwnerJB,
smsJBPrincipal,
smsJBConexion,
smsJBConexionClose,
smsJBConexionTrue,
smsJBConexionTrue2,
smsJBCargando,
smsJBInfo1,
smsJBInfo2,
smsJBDel,
smsJBAdios,
smsJBCerrarS,
smsJBErr,
smsContAdult,
smsList1,
smsList2,
smsList3,
smsList4,
smsList5,
smsList6,
smsConj,
smsFras,
smsContacto1,
smsContacto2,
smsContacto3,
smsContacto4,
smsContacto5,
smsContacto6,
smsContacto7,
smsContacto8,
smsJBConexionClose2,
smsIniJadi2,
smsreenvia
}
